export const blogPostsArr = [
	{
		id: "post-001",
		title: "У меня был план, и я его НЕ придерживался",
		descr: "Это был мой первый официальный полумарафон в этом году и я немного волновался. Очень хотел пробежать 21,1 км быстрее 2-х часов. То есть с темпом примерно 5:30 на километр. Для спортсменов это конечно не цель, но тем мне и нравится бег, что соревнуешься с собой вчерашним.",
		img: "/assets/img/blog/post-001.jpg",
		link: "/post-001",
	},
	{
		id: "post-002",
		title: "Удивительная недоказанная математическая гипотеза об одиноком бегуне",
		descr: "Математики — удивительные люди. Они обожают неразрешимые проблемы и недоказуемые гипотезы. Их хлебом не корми, дай только придумать какую-нибудь заковыристую задачу и дать ей какое-нибудь удивительное название. И ладно бы, если эти задачи были просто абстрактными упражнениям для ума. Но ведь как-то так получается, что многие из них имеют принципиальное значение для развития науки. Как заклинившая гайка — пока не открутишь, дальше не попадёшь.",
		img: "/assets/img/blog/post-002.jpg",
		link: "/post-002",
	},
	{
		id: "post-003",
		title: "SpaceX запустила Starship Flight 5, произошла первая в мире посадка ускорителя на стартовый стенд",
		descr: "13 октября 2024 года SpaceX запустила в тестовый полёт Starship Flight 5. Ранее Федеральное авиационное управление США одобрило выдачу лицензии на запуск космического корабля Starship в рамках пятого тестового полёта, в ход которого SpaceX попробует поймать первую ступень при обратном манёвре на стартовом столе. Космический корабль Starship успешно приводнился по итогам пятого тестового полета — заявление SpaceX.",
		img: "/assets/img/blog/post-003.jpg",
		link: "/post-003",
	},
	{
		id: "post-004",
		title: "Язык программирования Julia 1.11: новый релиз и много возможностей. Что добавили разработчики и что изменилось?",
		descr: "Выпущена новая версия языка программирования Julia 1.11, который сочетает высокую производительность с гибкостью динамической типизации, а также предлагает встроенные средства для параллельного программирования. Синтаксис языка схож с MATLAB, включает элементы Ruby и Lisp, а работа со строками напоминает Perl. Проект распространяется под лицензией MIT.В общем, хороший и нужный ЯП, о котором сегодня и поговорим. Подробности – под катом.",
		img: "/assets/img/blog/post-004.png",
		link: "/post-004",
	},
];
